CREATE DATABASE  IF NOT EXISTS `portpolio` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `portpolio`;
-- MySQL dump 10.13  Distrib 8.0.22, for Win64 (x86_64)
--
-- Host: localhost    Database: portpolio
-- ------------------------------------------------------
-- Server version	8.0.22

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `delivery`
--

DROP TABLE IF EXISTS `delivery`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `delivery` (
  `delivery_num` int NOT NULL AUTO_INCREMENT,
  `payment_num` int NOT NULL,
  `delivery_address` varchar(100) NOT NULL,
  `delevery_state` varchar(45) NOT NULL DEFAULT '대기중',
  `recipient` varchar(20) DEFAULT NULL,
  `demand` varchar(200) DEFAULT NULL,
  PRIMARY KEY (`delivery_num`),
  KEY `payment_num3_idx` (`payment_num`),
  CONSTRAINT `payment_num3` FOREIGN KEY (`payment_num`) REFERENCES `payment` (`payment_num`)
) ENGINE=InnoDB AUTO_INCREMENT=72 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `delivery`
--

LOCK TABLES `delivery` WRITE;
/*!40000 ALTER TABLE `delivery` DISABLE KEYS */;
INSERT INTO `delivery` VALUES (1,1,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(3,3,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(4,4,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(5,5,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(6,6,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(7,7,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(8,8,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(9,9,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(10,10,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(11,11,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(12,12,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(13,13,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(14,14,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(15,15,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(16,16,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(17,17,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(18,18,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(19,19,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(20,20,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(21,21,',서울 동대문구 청계천로 539','대기중',',홍길동',''),(22,22,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(23,23,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(24,24,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(25,25,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(26,26,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(27,27,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(28,28,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(29,29,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(30,30,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(31,31,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(32,32,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(33,33,',서울 동대문구 청계천로 539','대기중',',홍길동','안녕하세요'),(34,34,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(35,35,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(36,36,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(37,37,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(38,38,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(39,39,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(40,40,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(41,41,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(42,42,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(43,43,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(44,44,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(45,45,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(46,46,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(47,47,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(48,48,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(49,49,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(50,50,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(51,51,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(52,52,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(53,53,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(54,54,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(55,55,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(56,56,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(57,57,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(58,58,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(59,59,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(60,60,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(61,61,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(62,62,',서울 동대문구 청계천로 539','대기중',',스프링','안녕하세요'),(63,63,',서울 동대문구 청계천로 539','대기중',',장길산','qq'),(64,64,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요'),(65,65,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요'),(66,66,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요'),(67,67,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요'),(68,68,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요'),(69,69,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요'),(70,70,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요'),(71,71,',서울 동대문구 청계천로 539','대기중',',장길산','안녕하세요');
/*!40000 ALTER TABLE `delivery` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-03-22 17:44:47
